Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.settings.profilepreferencesviewcontroller.delete.e2d0a549
source: Delete
zh_hans: 删除

# ui.settings.profilepreferencesviewcontroller.delete_profile.6eaac81d
source: Delete profile %@?
zh_hans: 要删除配置文件“%@”吗？

# ui.settings.profilepreferencesviewcontroller.dynamic_profile_warning
source: The selected profile, “%@”, is a dynamic profile. These are generally only edited by hand. iTerm2 is now able to write changes back to dynamic profiles when they are marked as “rewritable“. Rewriting can cause the order of values to change.
zh_hans: 所选配置文件“%@”是动态配置文件，通常只应手动编辑。 iTerm2 现在可以将更改写回标记为“可重写”的动态配置文件。重写可能会改变值的顺序。

# ui.settings.profilepreferencesviewcontroller.error.54a0e8c1
source: Error
zh_hans: 错误

# ui.settings.profilepreferencesviewcontroller.import_from_failed.6cb14470
source: Import from %@ failed: %@
zh_hans: 从 %@ 导入失败：%@

# ui.settings.profilepreferencesviewcontroller.mark_as_rewritable.bff4593d
source: Mark as Rewritable
zh_hans: 标记为可重写

# ui.settings.profilepreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.profilepreferencesviewcontroller.replace.95e15439
source: Replace
zh_hans: 替换

source: Replace profile “%@” with the current session's settings?
zh_hans: 要用当前会话的设置替换配置文件“%@”吗？

# ui.settings.profilepreferencesviewcontroller.reveal_in_finder.cc849385
source: Reveal in Finder
zh_hans: 在访达中显示

# ui.settings.profilepreferencesviewcontroller.tags.2ec6c78c
source: < Tags
zh_hans: < 标签

# ui.settings.profilepreferencesviewcontroller.tags.ceb515fa
source: Tags >
zh_hans: 标签 >

# ui.settings.profilepreferencesviewcontroller.unknown_profile_name
source: (unknown name)
zh_hans: （名称未知）

# ui.settings.profiles.itermdynamicprofilemanager.additional_errors
source: %@ additional errors may be seen in the log.
zh_hans: 日志中可能还会显示 %@ 个错误。

# ui.settings.profiles.itermdynamicprofilemanager.dynamic_profiles_error.5aba939f
source: Dynamic Profiles Error
zh_hans: 动态配置文件错误

# ui.settings.profiles.itermdynamicprofilemanager.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.profiles.itermdynamicprofilemanager.one_additional_error
source: %@ additional error may be seen in the log.
zh_hans: 日志中可能还会显示 %@ 个错误。

# ui.settings.profiles.itermdynamicprofilemanager.profile_error
source: There was a problem with one of your Dynamic Profiles: %@
zh_hans: 某个动态配置文件出现问题： %@

# ui.settings.profiles.itermdynamicprofilemanager.reveal_in_finder.cc849385
source: Reveal in Finder
zh_hans: 在 Finder 中显示

# ui.settings.profiles.itermdynamicprofilemanager.view_log.a76646e2
source: View Log
zh_hans: 查看日志

# ui.settings.profiles.itermprofilesmenucontroller.open_all.d2043613
source: Open All
zh_hans: 全部打开

# ui.settings.profiles.itermprofilesmenucontroller.open_all_in_new_window.8127e3e0
source: Open All in New Window
zh_hans: 在新窗口中全部打开

# ui.settings.profiles.itermprofileswindowcontroller.contextual_menu.3db60c37
source: Contextual Menu
zh_hans: 上下文菜单

# ui.settings.profiles.itermprofileswindowcontroller.edit_profile.a34d4447
source: Edit Profile...
zh_hans: 编辑配置文件…

# ui.settings.profiles.itermprofileswindowcontroller.new_window.7469c2f6
source: New Window
zh_hans: 新建窗口

# ui.settings.profiles.itermprofileswindowcontroller.new_windows.57ab2d2b
source: New Windows
zh_hans: 新建窗口

# ui.settings.profiles.itermprofileswindowcontroller.open_in_new_tab.35e74c3a
source: Open in New Tab
zh_hans: 在新标签页中打开

# ui.settings.profiles.itermprofileswindowcontroller.open_in_new_tabs.7647b64f
source: Open in New Tabs
zh_hans: 在多个新标签页中打开

# ui.settings.profiles.itermprofileswindowcontroller.open_in_new_window.2f0cf49d
source: Open in new window
zh_hans: 在新窗口中打开

# ui.settings.profiles.itermprofileswindowcontroller.open_in_new_window.e8e0ccba
source: Open in New Window
zh_hans: 在新窗口中打开

# ui.settings.profiles.itermprofileswindowcontroller.open_in_new_windows.e512e42e
source: Open in New Windows
zh_hans: 在多个新窗口中打开

# ui.settings.profiles.itermprofileswindowcontroller.tags.2ec6c78c
source: < Tags
zh_hans: < 标签

# ui.settings.profiles.itermprofileswindowcontroller.tags.ceb515fa
source: Tags >
zh_hans: 标签 >

# ui.settings.profiles.profilelistview.command.71316697
source: Command
zh_hans: 命令

# ui.settings.profiles.profilelistview.profile_name.a423b477
source: Profile Name
zh_hans: 配置文件名称

# ui.settings.profiles.profilelistview.search_menu.b2490918
source: Search Menu
zh_hans: 搜索菜单

# ui.settings.profiles.profilelistview.search_syntax_help.74514d89
source: Search Syntax Help
zh_hans: 搜索语法帮助

# ui.settings.profiles.profilelistview.shortcut.5753ea37
source: Shortcut
zh_hans: 快捷键

# ui.settings.profiles.profilelistview.tags.1331275b
source: Tags
zh_hans: 标签

# ui.settings.profiles.profiletagsview.tag_name.077b1b77
source: Tag Name
zh_hans: 标签名称

# ui.settings.profilesadvancedpreferencesviewcontroller.edit_triggers.65f45106
source: Edit Triggers
zh_hans: 编辑触发器

# ui.settings.profilesadvancedpreferencesviewcontroller.enter_a_rule.346a42ce
source: Enter a rule…
zh_hans: 输入规则…

# ui.settings.profilesadvancedpreferencesviewcontroller.remove_from.feae7b27
source: Remove from “%@”
zh_hans: 从“%@”中移除

source: Remove from This Profile
zh_hans: 从此配置文件中移除

source: The profile “%@” is already bound to hostname “%@”.
zh_hans: 配置文件“%@”已绑定到主机名“%@”。

# ui.settings.profilescolorspreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.profilescolorspreferencesviewcontroller.could_not_save_to.1c8b29b9
source: Could not save to %@
zh_hans: 无法保存到 %@

# ui.settings.profilescolorspreferencesviewcontroller.dark_mode_label
source: Dark Mode
zh_hans: 深色模式

# ui.settings.profilescolorspreferencesviewcontroller.delete_preset.72adb099
source: Delete Preset…
zh_hans: 删除预设…

# ui.settings.profilescolorspreferencesviewcontroller.export.4a4c59c5
source: Export…
zh_hans: 导出…

# ui.settings.profilescolorspreferencesviewcontroller.import.ea94509e
source: Import…
zh_hans: 导入…

# ui.settings.profilescolorspreferencesviewcontroller.light_mode_label
source: Light Mode
zh_hans: 浅色模式

source: No deletable color presets.
zh_hans: 没有可删除的配色方案。

# ui.settings.profilescolorspreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.profilescolorspreferencesviewcontroller.save_as.a4b76af5
source: Save As…
zh_hans: 存储为…

# ui.settings.profilescolorspreferencesviewcontroller.save_color_preset.d1ec5ba6
source: Save Color Preset
zh_hans: 保存配色方案

# ui.settings.profilescolorspreferencesviewcontroller.save_failed.a1b57765
source: Save Failed.
zh_hans: 保存失败。

source: Select a preset to delete:
zh_hans: 选择要删除的预设：

# ui.settings.profilescolorspreferencesviewcontroller.select_preset_name.cd70f32b
source: Select preset name
zh_hans: 选择预设名称

source: This preset does not have separate colors for light mode and dark mode.
zh_hans: 此预设没有分别为浅色模式和深色模式设置颜色。

source: This preset has colors for both light mode and dark mode.
zh_hans: 此预设同时包含浅色模式和深色模式的颜色。

# ui.settings.profilescolorspreferencesviewcontroller.update_both_modes.402f7615
source: Update Both Modes
zh_hans: 更新两种模式

# ui.settings.profilescolorspreferencesviewcontroller.update_only.e79da5c8
source: Update %@ Only
zh_hans: 仅更新%@

# ui.settings.profilescolorspreferencesviewcontroller.update_which_modes.2a85c1b5
source: Update Which Modes?
zh_hans: 要更新哪些模式？

source: Visit Online Gallery
zh_hans: 访问在线图库

source: You cannot erase the built-in presets and no custom presets have been imported.
zh_hans: 无法删除内置预设，且尚未导入任何自定义预设。

# ui.settings.profilesgeneralpreferencesviewcontroller.ai_generated_name.2b1efb26
source: AI-generated name
zh_hans: AI 生成的名称

# ui.settings.profilesgeneralpreferencesviewcontroller.arguments_to_ssh.7319606f
source: Arguments to ssh
zh_hans: ssh 参数

# ui.settings.profilesgeneralpreferencesviewcontroller.as_a_hotkey.44b9579e
source: as a hotkey
zh_hans: 用作热键

source: Automatic loading doesn’t work with %@
zh_hans: 无法为 %@ 自动加载 Shell 集成

source: Built-in Icon for Current App
zh_hans: 当前应用的内置图标

source: Enter command to run when a new session is created
zh_hans: 输入新建会话时要运行的命令

source: Enter full path to shell
zh_hans: 输入 Shell 的完整路径

# ui.settings.profilesgeneralpreferencesviewcontroller.favicon.42955289
source: Favicon
zh_hans: 网站图标

# ui.settings.profilesgeneralpreferencesviewcontroller.initial_url.cb7e5826
source: Initial URL
zh_hans: 初始 URL

# ui.settings.profile.title_preview.host
source: Host
zh_hans: 主机

# ui.settings.profile.title_preview.job
source: Job
zh_hans: 进程

# ui.settings.profile.title_preview.job_and_arguments
source: Job+Args
zh_hans: 进程+参数

# ui.settings.profile.title_preview.name
source: Name
zh_hans: 名称

# ui.settings.profile.title_preview.profile
source: Profile
zh_hans: 配置文件

# ui.settings.profile.title_preview.user
source: User
zh_hans: 用户

source: Not available with browser tabs
zh_hans: 浏览器标签页不可用

# ui.settings.profilesgeneralpreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.profilesgeneralpreferencesviewcontroller.plugin_invalid.795aeb93
source: Plugin Invalid
zh_hans: 插件无效

source: Requires bash, fish, tcsh, xonsh, or zsh.
zh_hans: 需要 bash、fish、tcsh、xonsh 或 zsh。

# ui.settings.profilesgeneralpreferencesviewcontroller.select_url_schemes.3e03afa7
source: Select URL Schemes…
zh_hans: 选择 URL Scheme…

source: Shell integration needs a newer version of bash.
zh_hans: Shell 集成需要较新版本的 bash。

# ui.settings.profileskeyspreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.profileskeyspreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.profileskeyspreferencesviewcontroller.remove.c3812fc4
source: Remove
zh_hans: 移除

source: Remove Incompatible Key Bindings?
zh_hans: 要移除不兼容的按键绑定吗？

source: The keyboard shortcut you have set for this profile will take precedence over an existing shortcut for the same key combination in a global shortcut.
zh_hans: 你为此配置文件设置的键盘快捷键，将优先于全局快捷键中使用相同组合键的现有快捷键。

source: This profile has some key bindings from a preset that conflict with CSI u. Remove them?
zh_hans: 此配置文件中有一些来自预设的按键绑定与 CSI u 冲突。要移除它们吗？

source: You have chosen to have an option key act as Meta. This option is useful for backward compatibility with older systems. The "Esc+" option is recommended for most users.
zh_hans: 你已选择将 Option 键用作 Meta。此选项适合需要兼容旧系统的情况。建议大多数用户使用“Esc+”选项。

# ui.settings.profilessessionpreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.profilessessionpreferencesviewcontroller.enable_send_code.08be4b87
source: Enable Send Code
zh_hans: 启用“发送代码”

source: No sessions are currently preventing sleep.
zh_hans: 当前没有会话阻止系统进入睡眠。

source: 1 session is currently preventing sleep.
zh_hans: 当前有 1 个会话正在阻止系统睡眠。

source: 1 session would prevent sleep, but it is disabled while on battery.
zh_hans: 有 1 个会话请求阻止系统睡眠，但使用电池时此功能已停用。

source: %@ sessions are currently preventing sleep.
zh_hans: 当前有 %@ 个会话正在阻止系统睡眠。

source: %@ sessions would prevent sleep, but it is disabled while on battery.
zh_hans: 有 %@ 个会话请求阻止系统睡眠，但使用电池时此功能已停用。

source: You probably don’t want to turn this on. It's not suitable for keeping ssh sessions alive, even with a code of “0”. Are you sure you want this?
zh_hans: 你可能不希望启用此选项。它不适合用于保持 SSH 会话活跃，即使使用代码“0”也是如此。确定要启用吗？

# ui.settings.profilesterminalpreferencesviewcontroller.change_locale.29c8933a
source: Change Locale
zh_hans: 更改区域设置

source: Invalid encoding: neither $LC_CTYPE nor $LANG set.
zh_hans: 编码无效：未设置 $LC_CTYPE 或 $LANG。

# ui.settings.profilesterminalpreferencesviewcontroller.keep_this_locale.ccc8a1b5
source: Keep This Locale
zh_hans: 保留此区域设置

source: $LANG will not be set.
zh_hans: 不会设置 $LANG。

source: No locale selected.
zh_hans: 未选择区域设置。

source: No valid locale exists for this machine’s language and country.
zh_hans: 没有适用于此电脑语言和国家或地区的有效区域设置。

source: Select your preferred locale:
zh_hans: 选择首选区域设置：

source: Unexpectedly missing LC_CTYPE. Report a bug.
zh_hans: 意外缺少 LC_CTYPE。请报告此问题。

source: Warning! This profile uses a custom locale that doesn't use UTF-8 as its character encoding, but your profile *is* using UTF-8. This can cause error messages and non-ASCII text to appear wrong.
zh_hans: 警告！此配置文件使用自定义区域设置，其字符编码不是 UTF-8，但配置文件本身使用 UTF-8。这可能导致错误信息和非 ASCII 文本显示异常。

source: Wrong Encoding Detected
zh_hans: 检测到错误的编码

# ui.settings.profilestextpreferencesviewcontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.profilestextpreferencesviewcontroller.enable.5342e09f
source: Enable
zh_hans: 启用

source: You probably don’t want to turn this on. It will confuse interactive programs. You might want it if you work mostly with East Asian text combined with legacy or mathematical character sets. Are you sure you want this?
zh_hans: 你可能不希望启用此选项。它会干扰交互式程序。如果你主要处理与旧式或数学字符集混合的东亚文本，可能会需要它。确定要启用吗？

source: Choose an image for the background, or a folder to rotate through its images.
zh_hans: 选择背景图像，或选择一个文件夹以轮换显示其中的图像。

# ui.settings.profileswindowpreferencesviewcontroller.columns.53aade77
source: Columns
zh_hans: 列

# ui.settings.profileswindowpreferencesviewcontroller.columns_by.14b82ebb
source: columns by
zh_hans: 列 ×

# ui.settings.profileswindowpreferencesviewcontroller.empty_folder.f503ef8e
source: Empty Folder
zh_hans: 文件夹为空

# ui.settings.profileswindowpreferencesviewcontroller.folder.a6b3283e
source: Folder:
zh_hans: 文件夹：

# ui.settings.profileswindowpreferencesviewcontroller.image.8eafb034
source: Image:
zh_hans: 图像：

# ui.settings.profileswindowpreferencesviewcontroller.no_preference.5205fbdb
source: No Preference
zh_hans: 无偏好

# ui.settings.profileswindowpreferencesviewcontroller.of_screen_height.1214fece
source: % of screen height
zh_hans: 屏幕高度百分比

# ui.settings.profileswindowpreferencesviewcontroller.of_screen_width.7fc98e08
source: % of screen width
zh_hans: 屏幕宽度百分比

# ui.settings.profileswindowpreferencesviewcontroller.ok.565339bc
source: OK
zh_hans: 好

source: Problem Loading Folder
zh_hans: 加载文件夹时出现问题

source: Problem Loading Image
zh_hans: 加载图像时出现问题

# ui.settings.profileswindowpreferencesviewcontroller.rows.101f2ff3
source: Rows
zh_hans: 行

# ui.settings.profileswindowpreferencesviewcontroller.rows.bc51e9e6
source: rows
zh_hans: 行

# ui.settings.profileswindowpreferencesviewcontroller.screen_with_cursor.5012e093
source: Screen with Cursor
zh_hans: 光标所在屏幕

source: The folder “%@” contains no images, so no background image will be shown.
zh_hans: 文件夹“%@”不含图像，因此不会显示背景图像。

source: The folder “%@” could not be read.
zh_hans: 无法读取文件夹“%@”。

source: The folder “%@” could not be used because it does not exist or is not a directory.
zh_hans: 无法使用文件夹“%@”，因为它不存在或不是文件夹。

source: The image “%@” could not be loaded because it is corrupt or not a supported format.
zh_hans: 无法加载图像“%@”，因为文件已损坏或格式不受支持。

source: The image “%@” could not be loaded because the file is empty.
zh_hans: 无法加载图像“%@”，因为文件为空。

source: To have a new window open in a specific space, make sure that Spaces is enabled in System Preferences and that it is configured to switch directly to a space with ^ Number Keys.
zh_hans: 若要让新窗口在特定空间中打开，请确保已在“系统设置”中启用“空间”，并将其配置为使用 Control+数字键直接切换到相应空间。

# ui.settings.secure_user_defaults.create_folder_prompt
source: iTerm2 needs to create %1$@ to store secure settings because your home directory is on a network file system.
zh_hans: iTerm2 需要创建 %1$@ 来存储安全设置，因为您的个人文件夹位于网络文件系统上。

# ui.settings.smartselectioncontroller.actions.31dbec21
source: Actions…
zh_hans: 操作…

# ui.settings.smartselectioncontroller.actions.849c94b6
source: Actions (%@)…
zh_hans: 操作（%@）…

source: Click on text in playground to test rules
zh_hans: 点击游乐场中的文本以测试规则

source: Close Regular Expression Visualization
zh_hans: 关闭正则表达式可视化

# ui.settings.smartselectioncontroller.multiple_rules_selected.42db9283
source: Multiple rules selected
zh_hans: 已选择多个规则

# ui.settings.smartselectioncontroller.no_match.cd8d844d
source: No match
zh_hans: 无匹配项

# ui.settings.smartselectioncontroller.no_rule_selected.fe103a88
source: No rule selected
zh_hans: 未选择规则

source: Open Regular Expression Visualization
zh_hans: 打开正则表达式可视化

source: Smart Selection Playground Enter text here, then click to see which rule matches at that location.
zh_hans: 智能选择试验区 在此输入文本，然后点击相应位置以查看匹配的规则。

# ui.settings.triggercontroller.background.7b27ca8c
source: Background:
zh_hans: 背景：

# ui.settings.triggercontroller.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.triggercontroller.copied.8d525e5f
source: Copied
zh_hans: 已复制

# ui.settings.triggercontroller.copy_trigger_as_url_to_clipboard.ef98028a
source: Copy Trigger as URL to Clipboard
zh_hans: 将触发器以 URL 形式复制到剪贴板

# ui.settings.triggercontroller.dot.c8da5ec2
source: Dot:
zh_hans: 圆点：

# ui.settings.triggercontroller.error_saving_to.9c1965ed
source: Error saving to %@: %@
zh_hans: 保存到 %@ 时出错：%@

# ui.settings.triggercontroller.export_failed.9a5e4d95
source: Export Failed
zh_hans: 导出失败

# ui.settings.triggercontroller.export_to_file.c5afbdd5
source: Export to File
zh_hans: 导出到文件

# ui.settings.triggercontroller.import_failed.09876dab
source: Import Failed
zh_hans: 导入失败

# ui.settings.triggercontroller.malformed_file_at.7dee9e42
source: Malformed file at %@
zh_hans: %@ 处的文件格式不正确

# ui.settings.triggercontroller.name.dcd1d522
source: Name
zh_hans: 名称

# ui.settings.triggercontroller.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.triggercontroller.text.796961b8
source: Text:
zh_hans: 文本：

# ui.settings.triggercontroller.value.8e37953d
source: Value
zh_hans: 值

# ui.settings.triggercontroller.while_loading.6d2b4144
source: While loading %@: %@
zh_hans: 加载 %@ 时出错：%@

# ui.settings.triggercontroller.while_parsing.e18bb6fb
source: While parsing %@: %@
zh_hans: 解析 %@ 时出错：%@

source: An arrangement named “%@” already exists. Would you like to replace it?
zh_hans: 名为“%@”的窗口布局已存在。要替换它吗？

# ui.settings.windowarrangements.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.settings.windowarrangements.name_for_saved_window_arrangement.7c3f1164
source: Name for saved window arrangement:
zh_hans: 已保存窗口布局的名称：

# ui.settings.windowarrangements.no.1ea442a1
source: No
zh_hans: 否

# ui.settings.windowarrangements.ok.565339bc
source: OK
zh_hans: 好

# ui.settings.windowarrangements.replace_arrangement.a33d0dba
source: Replace Arrangement?
zh_hans: 要替换窗口布局吗？

source: Replace Existing Saved Window Arrangement?
zh_hans: 要替换现有的已保存窗口布局吗？

# ui.settings.windowarrangements.save_to_file_with_contents.d68eb17f
source: Save to File with Contents…
zh_hans: 保存到包含内容的文件…

source: There is an existing saved window arrangement with this name. Would you like to replace it with the current arrangement?
zh_hans: 已有同名的已保存窗口布局。要用当前布局替换它吗？

# ui.settings.windowarrangements.yes.85a39ab3
source: Yes
zh_hans: 是

# ui.shellintegration.itermshellhistorycontroller.about_shell_integration.1ccdc5f8
source: About Shell Integration
zh_hans: 关于 Shell 集成

# ui.shellintegration.itermshellhistorycontroller.install_now.b0e17c28
source: Install Now
zh_hans: 立即安装

# ui.shellintegration.itermshellhistorycontroller.learn_more.c8886ff2
source: Learn More…
zh_hans: 了解更多…

# ui.shellintegration.itermshellhistorycontroller.ok.565339bc
source: OK
zh_hans: 好

source: To use shell integration features such as Command History, Recent Directories, Select Output of Last Command, and Automatic Profile Switching, your shell must be properly configured.
zh_hans: 要使用命令历史、最近使用的目录、选择上一个命令的输出和自动切换配置文件等 Shell 集成功能，必须正确配置 Shell。

source: 😞 Your shell is not supported, or perhaps your $SHELL environment variable is not set correctly. Press “Continue” to try again.
zh_hans: 😞 不支持你的 Shell，或 $SHELL 环境变量设置不正确。按“继续”重试。

source: Learn more.
zh_hans: 了解更多。

source: Preview Command
zh_hans: 预览命令

source: Send Again
zh_hans: 再次发送

source: Press Option to Edit Before Sending
zh_hans: 按住 Option 可先编辑再发送

# ui.snippets.itermsnippetsmodel.ok.565339bc
source: OK
zh_hans: 好

# ui.snippets.itermsnippetsmodel.problem_saving_snippets.e454a3ec
source: Problem Saving Snippets
zh_hans: 保存片段时出现问题

source: There was a problem saving snippets to “%@”. The error was: %@
zh_hans: 将片段保存到“%@”时出现问题。 错误： %@

# ui.splitpanel.splitpanel.split_current_pane_horizontally_with_profile.d8d67385
source: Split current pane horizontally with profile:
zh_hans: 使用以下配置文件水平分割当前窗格：

# ui.splitpanel.splitpanel.split_current_pane_vertically_with_profile.8411968d
source: Split current pane vertically with profile:
zh_hans: 使用以下配置文件垂直分割当前窗格：

source: Failed to migrate session database (adding generation column): %@
zh_hans: 迁移会话数据库（添加 generation 列）失败：%@

source: Failed to migrate session database (adding large_data column): %@
zh_hans: 迁移会话数据库（添加 large_data 列）失败：%@

# ui.staterestoration.itermgraphdatabase.ok.565339bc
source: OK
zh_hans: 好

# ui.staterestoration.itermrestorablestatedriver.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.staterestoration.itermrestorablestatedriver.ok.565339bc
source: OK
zh_hans: 好

# ui.staterestoration.itermrestorablestatedriver.restore_windows.d38d4e43
source: Restore Windows?
zh_hans: 要恢复窗口吗？

source: Some windows had trouble restoring last time iTerm2 launched. Try again?
zh_hans: 上次启动 iTerm2 时，一些窗口恢复失败。要重试吗？

# ui.staterestoration.itermrestorablestatesqlite.discard_saved_windows.9d7a0de0
source: Discard Saved Windows
zh_hans: 丢弃已保存的窗口

source: iTerm2 is taking longer than usual to verify your saved windows and tabs. This usually means the system is busy and it’s safe to keep waiting, but a damaged state restoration database could also cause it. You can discard the saved windows instead if you’d rather not wait.
zh_hans: iTerm2 验证已保存窗口和标签页所用的时间比平时更长。这通常表示系统正忙，可以安全地继续等待，但状态恢复数据库损坏也可能导致此情况。如果不想等待，可以丢弃已保存的窗口。

# ui.staterestoration.itermrestorablestatesqlite.keep_waiting.c743a694
source: Keep Waiting
zh_hans: 继续等待

source: Still restoring your windows…
zh_hans: 仍在恢复窗口…

source: Show History
zh_hans: 显示历史记录

# ui.statusbar.components.itermstatusbaractioncomponent.edit_actions.3b800c60
source: Edit Actions…
zh_hans: 编辑操作…

source: Compression Resistance:
zh_hans: 抗压缩优先级：

# ui.statusbar.components.itermstatusbarbasecomponent.size_multiple.343d39f5
source: Size Multiple:
zh_hans: 尺寸倍数：

# ui.statusbar.components.itermstatusbargitcomponent.add_commit.59d42f3d
source: Add & Commit
zh_hans: 添加并提交

# ui.statusbar.components.itermstatusbargitcomponent.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.statusbar.components.itermstatusbargitcomponent.cancel.c51ee18a
source: Cancel %@
zh_hans: 取消 %@

# ui.statusbar.components.itermstatusbargitcomponent.check_out.53040b89
source: Check out %@
zh_hans: 检出 %@

# ui.statusbar.components.itermstatusbargitcomponent.commit.82a9c46f
source: Commit
zh_hans: 提交

# ui.statusbar.components.itermstatusbargitcomponent.copy.e21f935f
source: Copy
zh_hans: 拷贝

# ui.statusbar.components.itermstatusbargitcomponent.debug_info.697b4941
source: Debug Info
zh_hans: 调试信息

source: Directory: %@ Polling cadence: %@ sec Polling enabled: %@ Last polled %@ seconds ago Repo state: %@ %@
zh_hans: 目录：%@ 轮询间隔：%@ 秒 已启用轮询：%@ 上次轮询：%@ 秒前 仓库状态：%@ %@

# ui.statusbar.components.itermstatusbargitcomponent.git_timed_out.2c46ae50
source: git timed out
zh_hans: git 超时

# ui.statusbar.components.itermstatusbargitcomponent.increase_to_s.ae1b509c
source: Increase to %@s
zh_hans: 增加到 %@ 秒

# ui.statusbar.components.itermstatusbargitcomponent.log.21e49eb2
source: Log
zh_hans: 日志

source: Looks like you're sshed somewhere. OK to send the command “%@”?
zh_hans: 您似乎已通过 SSH 连接到其他位置。要发送命令“%@”吗？

# ui.statusbar.components.itermstatusbargitcomponent.ok.565339bc
source: OK
zh_hans: 好

# ui.statusbar.components.itermstatusbargitcomponent.problem_running_git.be5a0be2
source: Problem Running git
zh_hans: 运行 git 时出现问题

# ui.statusbar.components.itermstatusbargitcomponent.pull_origin.78258682
source: Pull origin %@
zh_hans: 从 origin %@ 拉取

# ui.statusbar.components.itermstatusbargitcomponent.push_origin.ad45a162
source: Push origin %@
zh_hans: 推送到 origin %@

# ui.statusbar.components.itermstatusbargitcomponent.reveal.36b830bd
source: Reveal
zh_hans: 显示
